Revit 2022 API
Document.Import Method
Overload List
Name | Description
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
Import(String, ImportOptions3DM, View)
 Imports a 3DM file into the document.
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
Import(String, SKPImportOptions, View)
 Imports a SKP file into the document.
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace